#ifndef DEVICEMANAGER_H
#define DEVICEMANAGER_H

class DeviceManager
{

private:

    // шина видеокадров
    // шина звука
    // шина комманд от устройств ввода
    // шина управления


    // По устройству
        // открытие
        // закрытие
        // привязка к шине данных
        // отвязка от шины данных
        // подписка на событие/чтение
        // отправка данных на устройство (где возможно)
        // тест
        // настройка
        // доступ к данным устройства (struct)

public:
    DeviceManager();
};

#endif // DEVICEMANAGER_H
